; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v9)
             (pred_8 ?v8 ?v4)
             (pred_5 ?v13 ?v4)
             (pred_9 ?v12 ?v13 )
	     (pred_6 ?v13)
             (pred_2 ?v7)
             (pred_11 ?v8)
             (pred_12 ?v4)
             (pred_10 ?v13)
             (pred_1 ?v8)
             (pred_3 ?v13)
             (pred_4 ))



(:action op_1
:parameters (?v2 ?v1 ?v3 ?v6)
:precondition (and (pred_2 ?v2) (pred_2 ?v1) (pred_11 ?v3) (pred_12 ?v6)
          (pred_7 ?v2 ?v1) (pred_8 ?v3 ?v6)
                   (pred_5 ?v1 ?v6) (pred_6 ?v2) 
                   (pred_10 ?v1) (pred_1 ?v3))
:effect (and  (pred_3 ?v1) (not (pred_10 ?v1))))


(:action op_3
:parameters (?v2 ?v10)
:precondition (and (pred_2 ?v2) (pred_2 ?v10)
               (pred_6 ?v2) (pred_7 ?v2 ?v10) (pred_3 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v2))))

(:action op_5
:parameters (?v2 ?v3)
:precondition (and (pred_2 ?v2) (pred_11 ?v3) 
                  (pred_6 ?v2) (pred_9 ?v3 ?v2) (pred_4 ))
:effect (and (pred_1 ?v3)
   (not (pred_9 ?v3 ?v2)) (not (pred_4 ))))


(:action op_4
:parameters (?v2 ?v11 ?v5)
:precondition (and (pred_2 ?v2) (pred_11 ?v11) (pred_11 ?v5)
                  (pred_6 ?v2) (pred_1 ?v5) (pred_9 ?v11 ?v2))
:effect (and (pred_1 ?v11) (pred_9 ?v5 ?v2)
        (not (pred_1 ?v5)) (not (pred_9 ?v11 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_2 ?v2) (pred_11 ?v3) 
                  (pred_6 ?v2) (pred_1 ?v3))
:effect (and (pred_4 ) (pred_9 ?v3 ?v2) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_17 obj_20 obj_06 obj_02 obj_03 obj_10 obj_13 obj_07 obj_04 obj_11 obj_01 obj_19 obj_18 obj_14 obj_09
    obj_08 obj_16 obj_15
    obj_21 obj_12 obj_05
    )

    (:init
       (pred_4)

       (pred_2 obj_22)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_06)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_18)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_11 obj_21)
       (pred_11 obj_12)
       (pred_11 obj_05)

       (pred_7 obj_22 obj_02)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_22)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_04 obj_18)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_01 obj_09)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_09 obj_01)
       (pred_7 obj_09 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_5  obj_07 obj_08)
       (pred_5  obj_11 obj_16)
       (pred_5  obj_17 obj_15)
       (pred_3 obj_22)
       (pred_3 obj_20)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_14)
       (pred_3 obj_09)

       (pred_8  obj_21 obj_08)
       (pred_8  obj_12 obj_16)
       (pred_8  obj_05 obj_15)
       (pred_9 obj_21 obj_10)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_05 obj_02)
       (pred_6 obj_14)
    )

    (:goal (and
       (pred_9 obj_12 obj_01)
    ))
(:constraints
  (always (not (pred_6 obj_13)))
)
)

; plan
1. (op_3 obj_14 obj_18)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_04)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_04)
   goals met: 0 of 1
3. (op_3 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_03)
   goals met: 0 of 1
4. (op_3 obj_03 obj_10)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_10)
   goals met: 0 of 1
5. (op_3 obj_10 obj_20)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_20)
   goals met: 0 of 1
6. (op_3 obj_20 obj_06)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_06)
   goals met: 0 of 1
7. (op_5 obj_06 obj_12)
   deleted: (pred_9 obj_12 obj_06) (pred_4)
   added: (pred_1 obj_12)
   goals met: 0 of 1
8. (op_3 obj_06 obj_20)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_20)
   goals met: 0 of 1
9. (op_3 obj_20 obj_10)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_10)
   goals met: 0 of 1
10. (op_1 obj_10 obj_11 obj_12 obj_16)
   deleted: (pred_10 obj_11)
   added: (pred_3 obj_11)
   goals met: 0 of 1
11. (op_3 obj_10 obj_11)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_11)
   goals met: 0 of 1
12. (op_3 obj_11 obj_01)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_01)
   goals met: 0 of 1
13. (op_2 obj_01 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_4) (pred_9 obj_12 obj_01)
   goals met: 1 of 1
